app/controllers/movies_controller.rb

    def index
        movies = Movie.all
        movies = movies.where(['day LIKE ?', "%#{params[:query]}%"]) if params[:query]
        movies = movies.map{ |m|
---
SELECT "movies".* FROM "movies" WHERE (day LIKE '%friday%')

    def create
        @movie = Movie.new(movie_params)
        if @movie.save
---
INSERT INTO "movies" ("title", "description", "url_movie", "day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)