app/controllers/reservation_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_movie
        @movie = Movie.where(id: reservation_params[:movie_id])