app/controllers/reservation_controller.rb

    def index
        reservations = Reservation.all
        reservations = reservations.find_by(movie_id: params[:movie_id])
---
SELECT "reservations".* FROM "reservations"
SELECT "reservations".* FROM "reservations" WHERE "reservations"."movie_id" = ? LIMIT ?  [["movie_id", 1], ["LIMIT", 1]]

    def create
        # byebug
        reservations = Reservation.all
        reservations = reservations.find_by(movie_id: params[:movie_id])
        if reservations
            reservationDate = Date.parse(reservations['date'])
            render json: { message: "Resevation has been created,for #{reservationDate} places", status: :ok}
        else
            @reservation = Reservation.new(reservation_params)
            if @reservation.save
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."movie_id" = ? LIMIT ?  [["movie_id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("date", "capacity", "movie_id") VALUES (?, ?, ?)  [["date", "2019-08-11 00:00:00"], ["capacity", 1], ["movie_id", 1]]