app/controllers/reservations_controller.rb

    def get_movie
        @movie = Movie.find_by(id: reservation_params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" IS NULL LIMIT ?  [["LIMIT", 1]]